Tekla Open API Reference for Tekla Structures 2025
View.ViewCoordinateSystem Property
 The local coordinate system for the view. Can be set when creating a view. The origin is always set to zero.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CoordinateSystem ViewCoordinateSystem { get; set; }
Public Property ViewCoordinateSystem As CoordinateSystem
	Get
	Set
Property Value
Type: CoordinateSystem
See Also
Reference
View Class
Tekla.Structures.Model.UI Namespace